app/controllers/items_controller.rb

SELECT * FROM "items" WHERE ("items"."playlist_id" = 1) ORDER BY items.id DESC LIMIT 1
SELECT * FROM "playlists" WHERE ("playlists"."id" = 2)
SELECT * FROM "songs" WHERE ("songs"."id" = 1)
---
  def create
    @playlist = Playlist.find(params[:item][:playlist_id])
    @song = Song.find(params[:item][:song_id])

SELECT * FROM "items" WHERE ("items"."id" = 12)
DELETE FROM "items" WHERE "id" = 12
---
  def destroy
    @item = Item.find(params[:id])

    if @item.destroy