app/controllers/playlists_controller.rb

  def show
    @playlist = Playlist.find(params[:id])
    @items = Item.scoped_by_playlist_id(params[:id], :sort => 'ordinal ASC')
    @items = @items.sort_by{|item| [item.ordinal, item.id]}
    @songs = []
    @items.each do |item|
---
SELECT * FROM "items" WHERE ("items"."playlist_id" = '1')
SELECT * FROM "playlists" LIMIT 1