app/controllers/playlists_controller.rb

SELECT * FROM "playlists" WHERE ("playlists"."id" = 1)
SELECT "songs".* FROM "songs" INNER JOIN "items" ON "songs".id = "items".song_id WHERE (("items".playlist_id = 1))
---
  def show
    @playlist = Playlist.find(params[:id])
    @items = []
    @items = @playlist.songs.collect { |song| Song.find(song) }

INSERT INTO "playlists" ("name", "created_at", "updated_at", "description") VALUES('Rock-n-Roll', '2009-06-24 02:16:29', '2009-06-24 02:16:29', 'we love the music')
---
  def create
    @playlist = Playlist.new(params[:playlist])
    if @playlist.save

SELECT * FROM "playlists" WHERE ("playlists"."id" = 3)
---
  def edit
    @playlist = Playlist.find(params[:id])

SELECT * FROM "playlists" WHERE ("playlists"."id" = 3)
UPDATE "playlists" SET "updated_at" = '2009-07-01 17:23:35', "name" = 'JonMagic' WHERE "id" = 3
---
  def update
    @playlist = Playlist.find(params[:id])
    if @playlist.update_attributes(params[:playlist])