app/controllers/songs_controller.rb

  def show
    @song = Song.find(params[:id])
---
SELECT * FROM "songs" WHERE ("songs"."id" = 1)

  def create
    @song = Song.new(params[:song])

    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("name", "duration", "artist", "created_at", "uuid", "updated_at", "song_updated_at", "album", "song_file_name", "song_file_size", "genre", "song_content_type") VALUES(NULL, NULL, NULL, '2009-07-01 15:34:41', '9e9cbc00-4882-012c-524a-002332b84254', '2009-07-01 15:34:41', '2009-07-01 15:34:41', NULL, '3_DOORS_DOWN_-_KRYPTONITE.mp3', 3726568, NULL, 'audio/mpeg')

  def destroy
    @song = Song.find(params[:id])
    @song.destroy
---
SELECT * FROM "songs" WHERE ("songs"."id" = 2)
DELETE FROM "songs" WHERE "id" = 2